# ExportLinetypeInfo Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeInfo Class
Members See Also
---
A value used to represent the info stored in the ExportLinetypeTable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExportLinetypeInfo : IDisposable
```

Visual Basic
---
```text
Public Class ExportLinetypeInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExportLinetypeInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportLinetypeInfo
# See Also
ExportLinetypeInfo Members
Autodesk.Revit.DB Namespace